<a href="https://colab.research.google.com/github/adudars/PedidON/blob/master/arquivos/9.8_ConsultasLeft%26Right%26FullJoin.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 9.8 CONSULTAS COM LEFT, RIGHT e FULL JOIN

## ESTABELECENDO CONEXÃO

### Instalando bibliotecas de acesso

In [1]:
#!pip install --user psycopg2-binary
#!pip install --user pandas

### Importando bibliotecas

In [2]:
import pandas as pd
import psycopg2

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

### Conectando com o banco através do psycopg2

In [3]:
conn = psycopg2.connect(host="lallah.db.elephantsql.com",database="nxthbnlu", user="nxthbnlu", password="buyAYKsY17pqexg1grIcJaWm0gHBsO2F")

## CONSULTAS

In [4]:
query1 = pd.read_sql_query("""
select id_pedido, descricao_item, descricao_obs
from pedido as p
inner join item_cardapio as ic on
(p.fk_id_itemcardapio = ic.id_itemcardapio)
left join observacao as o on
(o.fk_id_pedido = p.id_pedido)
""", conn)

In [5]:
query1

    id_pedido  ...                descricao_obs
0           1  ...                      Sem sal
1           4  ...      Um prato e talher extra
2           5  ...                    Sem nozes
3           7  ...                   Sem espuma
4           9  ...  Dois copos com gelo e limão
..        ...  ...                          ...
72         75  ...                         None
73         43  ...                         None
74          3  ...                         None
75         61  ...                         None
76         63  ...                         None

[77 rows x 3 columns]

In [6]:
query2 = pd.read_sql_query("""
select * from observacao 
right join pedido on observacao.fk_id_pedido = pedido.id_pedido;
""", conn)

In [7]:
query2

    id_obs                descricao_obs  ...  fk_id_comanda  fk_id_itemcardapio
0      1.0                      Sem sal  ...              1                   1
1      2.0      Um prato e talher extra  ...              3                   4
2      3.0                    Sem nozes  ...              3                   5
3      4.0                   Sem espuma  ...              4                   7
4      5.0  Dois copos com gelo e limão  ...              5                   9
..     ...                          ...  ...            ...                 ...
72     NaN                         None  ...             71                  16
73     NaN                         None  ...             31                  28
74     NaN                         None  ...              2                   3
75     NaN                         None  ...             49                  46
76     NaN                         None  ...             61                  48

[77 rows x 8 columns]

In [8]:
query3 = pd.read_sql_query("""select *
from pedido as p
full outer join observacao as o on
(p.id_pedido = o.fk_id_pedido);
""", conn)

In [9]:
query3

    id_pedido  quantidade  ...                descricao_obs  fk_id_pedido
0           1           2  ...                      Sem sal           1.0
1           4           3  ...      Um prato e talher extra           4.0
2           5           1  ...                    Sem nozes           5.0
3           7           1  ...                   Sem espuma           7.0
4           9           2  ...  Dois copos com gelo e limão           9.0
..        ...         ...  ...                          ...           ...
72         75           4  ...                         None           NaN
73         43           1  ...                         None           NaN
74          3           1  ...                         None           NaN
75         61           3  ...                         None           NaN
76         63           1  ...                         None           NaN

[77 rows x 8 columns]

In [10]:
query4 = pd.read_sql_query("""select nome_cliente, id_comanda, quantidade, nome_item
from cliente as c
inner join comanda as cd on
(c.id_cliente = cd.fk_id_cliente)
inner join pedido as p on
(cd.id_comanda = p.fk_id_comanda)
inner join item_cardapio as ic on
(p.fk_id_itemcardapio = ic.id_itemcardapio);
""", conn)

In [11]:
query4

   nome_cliente  id_comanda  quantidade              nome_item
0          Lara           1           1               Rua Sete
1          Lara           1           2          Reta da Penha
2         Jorge           2           1         Parque Moscoso
3         Clara           3           2  Bons ventos te trazem
4         Clara           3           1           Ilha de Socó
..          ...         ...         ...                    ...
72          Ana          71           4                  Appia
73          Ana          71           4                Cachaça
74          Ana          71           4                  Brisa
75      Eduarda          72           1                  Ciroc
76      Eduarda          72           6               Red Bull

[77 rows x 4 columns]